export function timeFormatter(params) {
    let time = new Date()
    let y = time.getFullYear();
    let month = time.getMonth() + 1;
    let d = time.getDate();
    if (params && params.prefix) {
        month = time.getMonth() + 1 > 10 ? time.getMonth() + 1 : '0' + (time.getMonth() + 1);
        d = time.getDate() > 10 ? time.getDate() : '0' + time.getDate();
    }
    let h = time.getHours();
    h = h < 10 ? ('0' + h) : h;
    let m = time.getMinutes();
    let s = time.getSeconds();
    m = m < 10 ? ('0' + m) : m;
    s = s < 10 ? ('0' + s) : s;
    // let w = this.getWeek(time.getDay());
    let obj = {};
    obj.date = y + '/' + month + '/' + d;
    obj.nowTime = h + ':' + m + ':' + s;
    // obj.w = w;
    if (params && params.format) {
        switch (params.format) {
            case "local":
                obj.date = y + '年' + month + '月' + d + '日';
                break;
            case "dash":
                obj.date = y + '-' + month + '-' + d;
                break;
        }
    }
    return obj
}

export const mapData ={
    "provinces": [
        {
            "citys": [
                {
                    "citysName": "石家庄市"
                },
                {
                    "citysName": "邯郸市"
                },
                {
                    "citysName": "唐山市"
                },
                {
                    "citysName": "保定市"
                },
                {
                    "citysName": "秦皇岛市"
                },
                {
                    "citysName": "邢台市"
                },
                {
                    "citysName": "张家口市"
                },
                {
                    "citysName": "承德市"
                },
                {
                    "citysName": "沧州市"
                },
                {
                    "citysName": "廊坊市"
                },
                {
                    "citysName": "衡水市"
                }
            ],
            "provinceName": "河北省"
        },
        {
            "citys": [
                {
                    "citysName": "太原市"
                },
                {
                    "citysName": "大同市"
                },
                {
                    "citysName": "朔州市"
                },
                {
                    "citysName": "阳泉市"
                },
                {
                    "citysName": "长治市"
                },
                {
                    "citysName": "晋城市"
                },
                {
                    "citysName": "忻州市"
                },
                {
                    "citysName": "吕梁市"
                },
                {
                    "citysName": "晋中市"
                },
                {
                    "citysName": "临汾市"
                },
                {
                    "citysName": "运城市"
                },
            ],
            "provinceName": "山西省"
        },
        {
            "citys": [
                {
                    "citysName": "呼和浩特市"
                },
                {
                    "citysName": "包头市"
                },
                {
                    "citysName": "乌海市"
                },
                {
                    "citysName": "赤峰市"
                },
                {
                    "citysName": "呼伦贝尔市"
                },
                {
                    "citysName": "通辽市"
                },
                {
                    "citysName": "乌兰察布市"
                },
                {
                    "citysName": "鄂尔多斯市"
                },
                {
                    "citysName": "巴彦淖尔市"
                },
            ],
            "provinceName": "内蒙古自治区"
        },
        {
            "citys": [
                {
                    "citysName": "沈阳市"
                },
                {
                    "citysName": "大连市"
                },
                {
                    "citysName": "朝阳市"
                },
                {
                    "citysName": "阜新市"
                },
                {
                    "citysName": "铁岭市"
                },
                {
                    "citysName": "抚顺市"
                },
                {
                    "citysName": "本溪市"
                },
                {
                    "citysName": "辽阳市"
                },
                {
                    "citysName": "鞍山市"
                },
                {
                    "citysName": "丹东市"
                },
                {
                    "citysName": "营口市"
                },
                {
                    "citysName": "盘锦市"
                },
                {
                    "citysName": "锦州市"
                },
                {
                    "citysName": "葫芦岛市"
                }
            ],
            "provinceName": "辽宁省"
        },
        {
            "citys": [
                {
                    "citysName": "长春市"
                },
                {
                    "citysName": "吉林市"
                },
                {
                    "citysName": "白城市"
                },
                {
                    "citysName": "松原市"
                },
                {
                    "citysName": "四平市"
                },
                {
                    "citysName": "辽源市"
                },
                {
                    "citysName": "通化市"
                },
                {
                    "citysName": "白山市"
                },
            ],
            "provinceName": "吉林省"
        },
        {
            "citys": [
                {
                    "citysName": "哈尔滨市"
                },
                {
                    "citysName": "齐齐哈尔市"
                },
                {
                    "citysName": "黑河市"
                },
                {
                    "citysName": "大庆市"
                },
                {
                    "citysName": "伊春市"
                },
                {
                    "citysName": "鹤岗市"
                },
                {
                    "citysName": "佳木斯市"
                },
                {
                    "citysName": "双鸭山市"
                },
                {
                    "citysName": "七台河市"
                },
                {
                    "citysName": "鸡西市"
                },
                {
                    "citysName": "牡丹江市"
                },
                {
                    "citysName": "绥化市"
                }
            ],
            "provinceName": "黑龙江省"
        },
        {
            "citys": [
                {
                    "citysName": "南京市"
                },
                {
                    "citysName": "徐州市"
                },
                {
                    "citysName": "连云港市"
                },
                {
                    "citysName": "宿迁市"
                },
                {
                    "citysName": "淮安市"
                },
                {
                    "citysName": "盐城市"
                },
                {
                    "citysName": "扬州市"
                },
                {
                    "citysName": "泰州市"
                },
                {
                    "citysName": "南通市"
                },
                {
                    "citysName": "镇江市"
                },
                {
                    "citysName": "常州市"
                },
                {
                    "citysName": "无锡市"
                },
                {
                    "citysName": "苏州市"
                }
            ],
            "provinceName": "江苏省"
        },
        {
            "citys": [
                {
                    "citysName": "杭州市"
                },
                {
                    "citysName": "宁波市"
                },
                {
                    "citysName": "湖州市"
                },
                {
                    "citysName": "嘉兴市"
                },
                {
                    "citysName": "舟山市"
                },
                {
                    "citysName": "绍兴市"
                },
                {
                    "citysName": "衢州市"
                },
                {
                    "citysName": "金华市"
                },
                {
                    "citysName": "台州市"
                },
                {
                    "citysName": "温州市"
                },
                {
                    "citysName": "丽水市"
                },
            ],
            "provinceName": "浙江省"
        },
        {
            "citys": [
                {
                    "citysName": "合肥市"
                },
                {
                    "citysName": "芜湖市"
                },
                {
                    "citysName": "蚌埠市"
                },
                {
                    "citysName": "淮南市"
                },
                {
                    "citysName": "马鞍山市"
                },
                {
                    "citysName": "淮北市"
                },
                {
                    "citysName": "铜陵市"
                },
                {
                    "citysName": "安庆市"
                },
                {
                    "citysName": "黄山市"
                },
                {
                    "citysName": "滁州市"
                },
                {
                    "citysName": "阜阳市"
                },
                {
                    "citysName": "宿州市"
                },
                {
                    "citysName": "六安市"
                },
                {
                    "citysName": "亳州市"
                },
                {
                    "citysName": "池州市"
                },
                {
                    "citysName": "宣城市"
                },
                {
                    "citysName": "巢湖市"
                }
            ],
            "provinceName": "安徽省"
        },
        {
            "citys": [
                {
                    "citysName": "厦门市"
                },
                {
                    "citysName": "福州市"
                },
                {
                    "citysName": "南平市"
                },
                {
                    "citysName": "三明市"
                },
                {
                    "citysName": "莆田市"
                },
                {
                    "citysName": "泉州市"
                },
                {
                    "citysName": "漳州市"
                },
                {
                    "citysName": "龙岩市"
                },
                {
                    "citysName": "宁德市"
                }
            ],
            "provinceName": "福建省"
        },
        {
            "citys": [
                {
                    "citysName": "南昌市"
                },
                {
                    "citysName": "九江市"
                },
                {
                    "citysName": "景德镇市"
                },
                {
                    "citysName": "鹰潭市"
                },
                {
                    "citysName": "新余市"
                },
                {
                    "citysName": "萍乡市"
                },
                {
                    "citysName": "赣州市"
                },
                {
                    "citysName": "上饶市"
                },
                {
                    "citysName": "抚州市"
                },
                {
                    "citysName": "宜春市"
                },
                {
                    "citysName": "吉安市"
                }
            ],
            "provinceName": "江西省"
        },
        {
            "citys": [
                {
                    "citysName": "济南市"
                },
                {
                    "citysName": "青岛市"
                },
                {
                    "citysName": "聊城市"
                },
                {
                    "citysName": "德州市"
                },
                {
                    "citysName": "东营市"
                },
                {
                    "citysName": "淄博市"
                },
                {
                    "citysName": "潍坊市"
                },
                {
                    "citysName": "烟台市"
                },
                {
                    "citysName": "威海市"
                },
                {
                    "citysName": "日照市"
                },
                {
                    "citysName": "临沂市"
                },
                {
                    "citysName": "枣庄市"
                },
                {
                    "citysName": "济宁市"
                },
                {
                    "citysName": "泰安市"
                },
                {
                    "citysName": "莱芜市"
                },
                {
                    "citysName": "滨州市"
                },
                {
                    "citysName": "菏泽市"
                }
            ],
            "provinceName": "山东省"
        },
        {
            "citys": [
                {
                    "citysName": "郑州市"
                },
                {
                    "citysName": "开封市"
                },
                {
                    "citysName": "洛阳市"
                },
                {
                    "citysName": "平顶山市"
                },
                {
                    "citysName": "安阳市"
                },
                {
                    "citysName": "鹤壁市"
                },
                {
                    "citysName": "新乡市"
                },
                {
                    "citysName": "焦作市"
                },
                {
                    "citysName": "濮阳市"
                },
                {
                    "citysName": "许昌市"
                },
                {
                    "citysName": "漯河市"
                },
                {
                    "citysName": "三门峡市"
                },
                {
                    "citysName": "南阳市"
                },
                {
                    "citysName": "商丘市"
                },
                {
                    "citysName": "周口市"
                },
                {
                    "citysName": "驻马店市"
                },
                {
                    "citysName": "信阳市"
                }
            ],
            "provinceName": "河南省"
        },
        {
            "citys": [
                {
                    "citysName": "武汉市"
                },
                {
                    "citysName": "十堰市"
                },
                {
                    "citysName": "襄阳市"
                },
                {
                    "citysName": "荆门市"
                },
                {
                    "citysName": "孝感市"
                },
                {
                    "citysName": "黄冈市"
                },
                {
                    "citysName": "鄂州市"
                },
                {
                    "citysName": "黄石市"
                },
                {
                    "citysName": "咸宁市"
                },
                {
                    "citysName": "荆州市"
                },
                {
                    "citysName": "宜昌市"
                },
                {
                    "citysName": "随州市"
                }
            ],
            "provinceName": "湖北省"
        },
        {
            "citys": [
                {
                    "citysName": "长沙市"
                },
                {
                    "citysName": "衡阳市"
                },
                {
                    "citysName": "张家界市"
                },
                {
                    "citysName": "常德市"
                },
                {
                    "citysName": "益阳市"
                },
                {
                    "citysName": "岳阳市"
                },
                {
                    "citysName": "株洲市"
                },
                {
                    "citysName": "湘潭市"
                },
                {
                    "citysName": "郴州市"
                },
                {
                    "citysName": "永州市"
                },
                {
                    "citysName": "邵阳市"
                },
                {
                    "citysName": "怀化市"
                },
                {
                    "citysName": "娄底市"
                }
            ],
            "provinceName": "湖南省"
        },
        {
            "citys": [
                {
                    "citysName": "广州市"
                },
                {
                    "citysName": "深圳市"
                },
                {
                    "citysName": "清远市"
                },
                {
                    "citysName": "韶关市"
                },
                {
                    "citysName": "河源市"
                },
                {
                    "citysName": "梅州市"
                },
                {
                    "citysName": "潮州市"
                },
                {
                    "citysName": "汕头市"
                },
                {
                    "citysName": "揭阳市"
                },
                {
                    "citysName": "汕尾市"
                },
                {
                    "citysName": "惠州市"
                },
                {
                    "citysName": "东莞市"
                },
                {
                    "citysName": "珠海市"
                },
                {
                    "citysName": "中山市"
                },
                {
                    "citysName": "江门市"
                },
                {
                    "citysName": "佛山市"
                },
                {
                    "citysName": "肇庆市"
                },
                {
                    "citysName": "云浮市"
                },
                {
                    "citysName": "阳江市"
                }
            ],
            "provinceName": "广东省"
        },
        {
            "citys": [
                {
                    "citysName": "南宁市"
                },
                {
                    "citysName": "桂林市"
                },
                {
                    "citysName": "柳州市"
                },
                {
                    "citysName": "梧州市"
                },
                {
                    "citysName": "贵港市"
                },
                {
                    "citysName": "玉林市"
                },
                {
                    "citysName": "钦州市"
                },
                {
                    "citysName": "北海市"
                },
                {
                    "citysName": "防城港市"
                },
                {
                    "citysName": "崇左市"
                },
                {
                    "citysName": "百色市"
                },
                {
                    "citysName": "河池市"
                },
                {
                    "citysName": "来宾市"
                },
                {
                    "citysName": "贺州市"
                }
            ],
            "provinceName": "广西壮族自治区"
        },
        {
            "citys": [
                {
                    "citysName": "海口市"
                },
                {
                    "citysName": "三亚市"
                },
                {
                    "citysName": "三沙市"
                },
                {
                    "citysName": "儋州市"
                }
            ],
            "provinceName": "海南省"
        },
        {
            "citys": [
                {
                    "citysName": "成都市"
                },
                {
                    "citysName": "广元市"
                },
                {
                    "citysName": "绵阳市"
                },
                {
                    "citysName": "德阳市"
                },
                {
                    "citysName": "南充市"
                },
                {
                    "citysName": "广安市"
                },
                {
                    "citysName": "遂宁市"
                },
                {
                    "citysName": "内江市"
                },
                {
                    "citysName": "乐山市"
                },
                {
                    "citysName": "自贡市"
                },
                {
                    "citysName": "泸州市"
                },
                {
                    "citysName": "宜宾市"
                },
                {
                    "citysName": "攀枝花市"
                },
                {
                    "citysName": "巴中市"
                },
                {
                    "citysName": "达州市"
                },
                {
                    "citysName": "资阳市"
                },
                {
                    "citysName": "眉山市"
                },
                {
                    "citysName": "雅安市"
                }
            ],
            "provinceName": "四川省"
        },
        {
            "citys": [
                {
                    "citysName": "贵阳市"
                },
                {
                    "citysName": "六盘水市"
                },
                {
                    "citysName": "遵义市"
                },
                {
                    "citysName": "安顺市"
                }
            ],
            "provinceName": "贵州省"
        },
        {
            "citys": [
                {
                    "citysName": "昆明市"
                },
                {
                    "citysName": "曲靖市"
                },
                {
                    "citysName": "玉溪市"
                },
                {
                    "citysName": "丽江市"
                },
                {
                    "citysName": "昭通市"
                },
                {
                    "citysName": "普洱市"
                },
                {
                    "citysName": "临沧市"
                },
                {
                    "citysName": "保山市"
                }
            ],
            "provinceName": "云南省"
        },
        {
            "citys": [
                {
                    "citysName": "西安市"
                },
                {
                    "citysName": "延安市"
                },
                {
                    "citysName": "铜川市"
                },
                {
                    "citysName": "渭南市"
                },
                {
                    "citysName": "咸阳市"
                },
                {
                    "citysName": "宝鸡市"
                },
                {
                    "citysName": "汉中市"
                },
                {
                    "citysName": "榆林市"
                },
                {
                    "citysName": "商洛市"
                },
                {
                    "citysName": "安康市"
                }
            ],
            "provinceName": "陕西省"
        },
        {
            "citys": [
                {
                    "citysName": "兰州市"
                },
                {
                    "citysName": "嘉峪关市"
                },
                {
                    "citysName": "金昌市"
                },
                {
                    "citysName": "白银市"
                },
                {
                    "citysName": "天水市"
                },
                {
                    "citysName": "酒泉市"
                },
                {
                    "citysName": "张掖市"
                },
                {
                    "citysName": "武威市"
                },
                {
                    "citysName": "庆阳市"
                },
                {
                    "citysName": "平凉市"
                },
                {
                    "citysName": "定西市"
                },
                {
                    "citysName": "陇南市"
                }
            ],
            "provinceName": "甘肃省"
        },
        {
            "citys": [
                {
                    "citysName": "西宁市"
                },
                {
                    "citysName": "海东市"
                }
            ],
            "provinceName": "青海省"
        },
        {
            "citys": [
                {
                    "citysName": "拉萨市"
                },
                {
                    "citysName": "日喀则市"
                },
                {
                    "citysName": "昌都市"
                },
                {
                    "citysName": "林芝市"
                },
                {
                    "citysName": "山南市"
                }
            ],
            "provinceName": "西藏自治区"
        },
        {
            "citys": [
                {
                    "citysName": "银川市"
                },
                {
                    "citysName": "石嘴山市"
                },
                {
                    "citysName": "吴忠市"
                },
                {
                    "citysName": "中卫市"
                },
                {
                    "citysName": "固原市"
                }
            ],
            "provinceName": "宁夏回族自治区"
        },
        {
            "citys": [
                {
                    "citysName": "台北市"
                },
                {
                    "citysName": "新北市"
                },
                {
                    "citysName": "桃园市"
                },
                {
                    "citysName": "台中市"
                },
                {
                    "citysName": "台南市"
                },
                {
                    "citysName": "高雄市"
                },
                {
                    "citysName": "基隆市"
                },
                {
                    "citysName": "新竹市"
                },
                {
                    "citysName": "嘉义市"
                }
            ],
            "provinceName": "台湾"
        },
        {
            "citys": [
                {
                    "citysName": "北京市"
                }
            ],
            "provinceName": "北京市"
        },
        {
            "citys": [
                {
                    "citysName": "天津市"
                }
            ],
            "provinceName": "天津市"
        },
        {
            "citys": [
                {
                    "citysName": "上海市"
                }
            ],
            "provinceName": "上海市"
        },
        {
            "citys": [
                {
                    "citysName": "重庆市"
                }
            ],
            "provinceName": "重庆市"
        },
        {
            "citys": [
                {
                    "citysName": "香港特别行政区"
                }
            ],
            "provinceName": "香港"
        },
        {
            "citys": [
                {
                    "citysName": "澳门特别行政区"
                }
            ],
            "provinceName": "澳门"
        },
        {
            "citys": [
                {
                    "citysName": "乌鲁木齐市"
                },
                {
                    "citysName": "克拉玛依市"
                },
                {
                    "citysName": "吐鲁番市"
                },
                {
                    "citysName": "哈密市"
                },
            ],
            "provinceName": "新疆维吾尔自治区"
        }
    ]
}
export const geoCoordMap ={
    海门: [121.15, 31.89],
    孝感:[113.926655,30.926423],
    黄冈:[114.879365,30.447711],
    鄂州:[114.890593,30.396536],
    随州:[113.37377,31.717497],
    襄阳:[112.144146,32.042426],
    荆门:[112.204251,31.03542],
    黄石:[115.077048,30.220074],
    咸宁:[114.328963,29.832798],
    十堰:[110.787916,32.646907],
    仙桃:[113.453974,30.364953],
    鄂州:[114.890593,30.396536],
    日本: [139.691706,35.689487],
    新加坡: [103.819836,1.352083],
    韩国:[127.98,37.66],
    泰国:[100.99, 15.87],
    马来西亚:[101.98,4.21],
    德国:[10.45,51.17],
    越南: [108.28, 14.06],
    澳大利亚: [133.78,-25.27],
    美国:  [-95.71, 37.09],
    法国: [2.21,46.23],
    英国: [-3.44, 55.38],
    阿联酋: [53.85, 23.42],
    加拿大: [-106.35,56.13],
    意大利: [12.57,41.87],
    菲律宾: [121.77,12.88],
    印度: [78.96,20.59],
    俄罗斯: [105.32,61.52],
    西班牙: [-3.75,40.46],
    芬兰: [25.75,61.92],
    瑞典: [18.64,60.13],
    尼泊尔: [84.12,28.39],
    柬埔寨: [105.46,12.00],
    斯里兰卡: [80.77,7.87],
    埃及: [30.80,26.82],
    比利时: [4.47,50.50],
    鄂尔多斯: [109.781327, 39.608266],
    招远: [120.38, 37.35],
    舟山: [122.207216, 29.985295],
    齐齐哈尔: [123.97, 47.33],
    盐城: [120.13, 33.38],
    赤峰: [118.87, 42.28],
    青岛: [120.33, 36.07],
    乳山: [121.52, 36.89],
    金昌: [102.188043, 38.520089],
    泉州: [118.58, 24.93],
    莱西: [120.53, 36.86],
    日照: [119.46, 35.42],
    胶南: [119.97, 35.88],
    南通: [121.05, 32.08],
    拉萨: [91.11, 29.97],
    云浮: [112.02, 22.93],
    梅州: [116.1, 24.55],
    文登: [122.05, 37.2],
    上海: [121.48, 31.22],
    攀枝花: [101.718637, 26.582347],
    威海: [122.1, 37.5],
    承德: [117.93, 40.97],
    厦门: [118.1, 24.46],
    汕尾: [115.375279, 22.786211],
    潮州: [116.63, 23.68],
    丹东: [124.37, 40.13],
    太仓: [121.1, 31.45],
    曲靖: [103.79, 25.51],
    烟台: [121.39, 37.52],
    福州: [119.3, 26.08],
    瓦房店: [121.979603, 39.627114],
    即墨: [120.45, 36.38],
    抚顺: [123.97, 41.97],
    玉溪: [102.52, 24.35],
    张家口: [114.87, 40.82],
    阳泉: [113.57, 37.85],
    莱州: [119.942327, 37.177017],
    湖州: [120.1, 30.86],
    汕头: [116.69, 23.39],
    昆山: [120.95, 31.39],
    宁波: [121.56, 29.86],
    湛江: [110.359377, 21.270708],
    揭阳: [116.35, 23.55],
    荣成: [122.41, 37.16],
    连云港: [119.16, 34.59],
    葫芦岛: [120.836932, 40.711052],
    常熟: [120.74, 31.64],
    东莞: [113.75, 23.04],
    河源: [114.68, 23.73],
    淮安: [119.15, 33.5],
    泰州: [119.9, 32.49],
    南宁: [108.33, 22.84],
    营口: [122.18, 40.65],
    惠州: [114.4, 23.09],
    江阴: [120.26, 31.91],
    蓬莱: [120.75, 37.8],
    韶关: [113.62, 24.84],
    嘉峪关: [98.289152, 39.77313],
    广州: [113.23, 23.16],
    延安: [109.47, 36.6],
    太原: [112.53, 37.87],
    清远: [113.01, 23.7],
    中山: [113.38, 22.52],
    昆明: [102.73, 25.04],
    寿光: [118.73, 36.86],
    盘锦: [122.070714, 41.119997],
    长治: [113.08, 36.18],
    深圳: [114.07, 22.62],
    珠海: [113.52, 22.3],
    宿迁: [118.3, 33.96],
    咸阳: [108.72, 34.36],
    铜川: [109.11, 35.09],
    平度: [119.97, 36.77],
    佛山: [113.11, 23.05],
    海口: [110.35, 20.02],
    江门: [113.06, 22.61],
    章丘: [117.53, 36.72],
    肇庆: [112.44, 23.05],
    大连: [121.62, 38.92],
    临汾: [111.5, 36.08],
    吴江: [120.63, 31.16],
    石嘴山: [106.39, 39.04],
    沈阳: [123.38, 41.8],
    苏州: [120.62, 31.32],
    茂名: [110.88, 21.68],
    嘉兴: [120.76, 30.77],
    长春: [125.35, 43.88],
    胶州: [120.03336, 36.264622],
    银川: [106.27, 38.47],
    张家港: [120.555821, 31.875428],
    三门峡: [111.19, 34.76],
    锦州: [121.15, 41.13],
    南昌: [115.89, 28.68],
    柳州: [109.4, 24.33],
    三亚: [109.511909, 18.252847],
    自贡: [104.778442, 29.33903],
    吉林: [126.57, 43.87],
    阳江: [111.95, 21.85],
    泸州: [105.39, 28.91],
    西宁: [101.74, 36.56],
    宜宾: [104.56, 29.77],
    呼和浩特: [111.65, 40.82],
    成都: [104.06, 30.67],
    大同: [113.3, 40.12],
    镇江: [119.44, 32.2],
    桂林: [110.28, 25.29],
    张家界: [110.479191, 29.117096],
    宜兴: [119.82, 31.36],
    北海: [109.12, 21.49],
    西安: [108.95, 34.27],
    金坛: [119.56, 31.74],
    东营: [118.49, 37.46],
    牡丹江: [129.58, 44.6],
    遵义: [106.9, 27.7],
    绍兴: [120.58, 30.01],
    扬州: [119.42, 32.39],
    常州: [119.95, 31.79],
    潍坊: [119.1, 36.62],
    重庆: [106.54, 29.59],
    台州: [121.420757, 28.656386],
    南京: [118.78, 32.04],
    滨州: [118.03, 37.36],
    贵阳: [106.71, 26.57],
    无锡: [120.29, 31.59],
    本溪: [123.73, 41.3],
    克拉玛依: [84.77, 45.59],
    渭南: [109.5, 34.52],
    马鞍山: [118.48, 31.56],
    宝鸡: [107.15, 34.38],
    焦作: [113.21, 35.24],
    句容: [119.16, 31.95],
    北京: [116.46, 39.92],
    徐州: [117.2, 34.26],
    衡水: [115.72, 37.72],
    包头: [110, 40.58],
    绵阳: [104.73, 31.48],
    乌鲁木齐: [87.68, 43.77],
    枣庄: [117.57, 34.86],
    杭州: [120.19, 30.26],
    淄博: [118.05, 36.78],
    鞍山: [122.85, 41.12],
    溧阳: [119.48, 31.43],
    库尔勒: [86.06, 41.68],
    安阳: [114.35, 36.1],
    开封: [114.35, 34.79],
    济南: [117, 36.65],
    德阳: [104.37, 31.13],
    温州: [120.65, 28.01],
    九江: [115.97, 29.71],
    邯郸: [114.47, 36.6],
    临安: [119.72, 30.23],
    兰州: [103.73, 36.03],
    沧州: [116.83, 38.33],
    临沂: [118.35, 35.05],
    南充: [106.110698, 30.837793],
    天津: [117.2, 39.13],
    富阳: [119.95, 30.07],
    泰安: [117.13, 36.18],
    诸暨: [120.23, 29.71],
    郑州: [113.65, 34.76],
    哈尔滨: [126.63, 45.75],
    聊城: [115.97, 36.45],
    芜湖: [118.38, 31.33],
    唐山: [118.02, 39.63],
    平顶山: [113.29, 33.75],
    邢台: [114.48, 37.05],
    德州: [116.29, 37.45],
    济宁: [116.59, 35.38],
    荆州: [112.239741, 30.335165],
    宜昌: [111.3, 30.7],
    义乌: [120.06, 29.32],
    丽水: [119.92, 28.45],
    洛阳: [112.44, 34.7],
    秦皇岛: [119.57, 39.95],
    株洲: [113.16, 27.83],
    石家庄: [114.48, 38.03],
    莱芜: [117.67, 36.19],
    常德: [111.69, 29.05],
    保定: [115.48, 38.85],
    湘潭: [112.91, 27.87],
    金华: [119.64, 29.12],
    岳阳: [113.09, 29.37],
    长沙: [113, 28.21],
    衢州: [118.88, 28.97],
    廊坊: [116.7, 39.53],
    菏泽: [115.480656, 35.23375],
    合肥: [117.27, 31.86],
    武汉: [114.31, 30.52],
    大庆: [125.03, 46.58],
    湖北:[113.298572,30.684355],
    广东:[113.280637,23.125178],
    河南:[113.665412,33.757975],
    浙江:[120.153576,29.287459],
    湖南:[111.782279,28.09409],
    安徽:[117.283042,31.26119],
    江西:[115.592151,27.676493],
    江苏:[119.767413,33.041544],
    山东:[118.000923,36.275807],
    四川:[104.065735,30.659462],
    黑龙江:[128.642464,46.756967],
    河北:[114.502461,38.045474],
    福建:[118.306239,26.075302],
    陕西:[111.849248,36.857014],
    广西:[108.320004,22.82402],
    云南:[101.512251,24.740609],
    海南:[109.83119,19.031971],
    贵州:[106.713478,26.578343],
    山西:[111.849248,36.857014],
    天津:[117.190182,39.125596],
    辽宁:[123.429096,41.796767],
    甘肃:[103.823557,36.058039],
    吉林:[125.3245,43.886841],
    新疆:[85.617733,40.792818],
    内蒙古:[111.670801,41.818311],
    宁夏:[106.278179,37.26637],
    香港:[114.173355,22.320048],
    台湾:[121.509062,24.044332],
    青海:[96.778916,35.623178],
    澳门:[113.54909,22.198951],
    西藏:[89.132212,30.860361]
}

export const provList =[
    ["黑龙江", "rgb(152,17,11)"],
    ["吉林省", "rgb(189,22,11)"],
    ["辽宁", "rgb(189,22,11)"],
    ["内蒙古", "#ff0000"],
    ["河北", "rgb(152,17,11)"],
    ["北京", "rgb(152,17,11)"],
    ["天津", "rgb(190,22,11)"],
    ["山东省", "rgb(152,17,11)"],
    ["江苏", "rgb(152,17,11)"],
    ["上海", "rgb(152,17,11)"],
    ["浙江", "rgba(143,0,2,.7)"],
    ["福建", "rgb(152,17,11)"],
    ["台湾", "rgb(189,22,11)"],
    ["广东", "rgba(143,0,2,.7)"],
    ["香港", "#F09ABD"],
    ["澳门", "#F09ABD"],
    ["海南", "rgb(189,22,11)"],
    ["广西", "rgb(152,17,11)"],
    ["云南", "rgb(152,17,11)"],
    ["西藏", "#ff2400"],
    ["新疆", "#ff0000"],
    ["甘肃", "#ff0000"],
    ["青海", "#ff0000"],
    ["四川", "rgba(152,17,11,.7)"],
    ["贵州", "rgb(190,22,11)"],
    ["重庆", "rgb(152,17,11)"],
    ["湖南", "rgb(152,17,11)"],
    ["江西", "rgb(152,17,11)"],
    ["湖北", "rgb(103,16,11)"],
    ["安徽", "rgb(152,17,11)"],
    ["河南", "rgb(152,17,11)"],
    ["陕西", "rgb(152,17,11)"],
    ["山西", "rgb(190,22,11)"],
    ["宁夏", "#ff0000"]
]

